Sun Nov  6 12:49:24 2022 - INFO  - Start to prepare the test environment.
Sun Nov  6 12:51:29 2022 - INFO  - Finish preparing the test environment.
Sun Nov  6 12:51:32 2022 - INFO  - Start to run test.
spawn phpdbg --help
q

[1mphpdbg[0m
is
a
lightweight,
powerful
and
easy
to
use
debugging
platform
for
PHP5.4+
It
supports
the
following
commands:

[1mInformation[0m


[1mlist[0m





list
PHP
source


[1minfo[0m





displays
information
on
the
debug
session


[1mprint[0m




show
opcodes


[1mframe[0m




select
a
stack
frame
and
print
a
stack
frame
summary


[1mgenerator[0m
show
active
generators
or
select
a
generator
frame


[1mback[0m





shows
the
current
backtrace


[1mhelp[0m





provide
help
on
a
topic

[1mStarting
and
Stopping
Execution[0m


[1mexec[0m





set
execution
context


[1mstdin[0m




set
executing
script
from
stdin


[1mrun[0m






attempt
execution


[1mstep[0m





continue
execution
until
other
line
is
reached


[1mcontinue[0m

continue
execution


[1muntil[0m




continue
execution
up
to
the
given
location


[1mnext[0m





continue
execution
up
to
the
given
location
and
halt
on
the
first
line
after
it


[1mfinish[0m



continue
up
to
end
of
the
current
execution
frame


[1mleave[0m




continue
up
to
end
of
the
current
execution
frame
and
halt
after
the
calling
instruction


[1mbreak[0m




set
a
breakpoint
at
the
specified
target


[1mwatch[0m




set
a
watchpoint
on
$variable


[1mclear[0m




clear
one
or
all
breakpoints


[1mclean[0m




clean
the
execution
environment

[1mMiscellaneous[0m


[1mset[0m






set
the
phpdbg
configuration


[1msource[0m



execute
a
phpdbginit
script


[1mregister[0m

register
a
phpdbginit
function
as
a
command
alias


[1msh[0m







shell
a
command


[1mev[0m







evaluate
some
code


[1mquit[0m





exit
phpdbg

Type
[1mhelp
<command>[0m
or
([1mhelp
alias[0m)
to
get
detailed
help
on
any
of
the
above
commands,
for
example
[1mhelp
list[0m
or
[1mh
l[0m.

Note
that
help
will
also
match
partial
commands
if
unique
(and
list
out
options
if
not
unique),
so
[1mhelp
exp[0m
will
give
help
on
the
[1mexport[0m
command,
but
[1mhelp
ex[0m
will
list
the
summary
for
[1mexec[0m
and
[1mexport[0m.

Type
[1mhelp
aliases[0m
to
show
a
full
alias
list,
including
any
registered
phpdginit
functions
Type
[1mhelp
syntax[0m
for
a
general
introduction
to
the
command
syntax.
Type
[1mhelp
options[0m
for
a
list
of
phpdbg
command
line
options.
Type
[1mhelp
phpdbginit[0m
to
show
how
to
customise
the
debugger
environment.
phpdbg 8.0.0 (built: Nov 24 2020 17:04:03)
spawn phpdbg
[0;32m[Welcome to phpdbg, the interactive PHP debugger, v8.0.0][0m
To get help using phpdbg type "help" and press enter
[0;32m[Please report bugs to <http://bugs.php.net/report.php>][0m
prompt> list
[1;31m[The command "list" expected at least 1 arguments (*) and received 0][0m
prompt> info
Execution Context Information

Readline   unavailable
Exec       none
Compiled   no
Stepping   off
Quietness  on
Oplog      off
Executing  no
Classes    136
Functions  1042
Constants  1789
Included   0
prompt> print
[1;31m[Not Executing!][0m
prompt> frame
[0;32m[Currently in frame #0][0m
prompt> generator
[1;31m[Not executing!][0m
prompt> back
[1;31m[Not executing!][0m
prompt> help
q

[1mphpdbg[0m
is
a
lightweight,
powerful
and
easy
to
use
debugging
platform
for
PHP5.4+
It
supports
the
following
commands:

[1mInformation[0m


[1mlist[0m





list
PHP
source


[1minfo[0m





displays
information
on
the
debug
session


[1mprint[0m




show
opcodes


[1mframe[0m




select
a
stack
frame
and
print
a
stack
frame
summary


[1mgenerator[0m
show
active
generators
or
select
a
generator
frame


[1mback[0m





shows
the
current
backtrace


[1mhelp[0m





provide
help
on
a
topic

[1mStarting
and
Stopping
Execution[0m


[1mexec[0m





set
execution
context


[1mstdin[0m




set
executing
script
from
stdin


[1mrun[0m






attempt
execution


[1mstep[0m





continue
execution
until
other
line
is
reached


[1mcontinue[0m

continue
execution


[1muntil[0m




continue
execution
up
to
the
given
location


[1mnext[0m





continue
execution
up
to
the
given
location
and
halt
on
the
first
line
after
it


[1mfinish[0m



continue
up
to
end
of
the
current
execution
frame


[1mleave[0m




continue
up
to
end
of
the
current
execution
frame
and
halt
after
the
calling
instruction


[1mbreak[0m




set
a
breakpoint
at
the
specified
target


[1mwatch[0m




set
a
watchpoint
on
$variable


[1mclear[0m




clear
one
or
all
breakpoints


[1mclean[0m




clean
the
execution
environment

[1mMiscellaneous[0m


[1mset[0m






set
the
phpdbg
configuration


[1msource[0m



execute
a
phpdbginit
script


[1mregister[0m

register
a
phpdbginit
function
as
a
command
alias


[1msh[0m







shell
a
command


[1mev[0m







evaluate
some
code


[1mquit[0m





exit
phpdbg

Type
[1mhelp
<command>[0m
or
([1mhelp
alias[0m)
to
get
detailed
help
on
any
of
the
above
commands,
for
example
[1mhelp
list[0m
or
[1mh
l[0m.

Note
that
help
will
also
match
partial
commands
if
unique
(and
list
out
options
if
not
unique),
so
[1mhelp
exp[0m
will
give
help
on
the
[1mexport[0m
command,
but
[1mhelp
ex[0m
will
list
the
summary
for
[1mexec[0m
and
[1mexport[0m.

Type
[1mhelp
aliases[0m
to
show
a
full
alias
list,
including
any
registered
phpdginit
functions
Type
[1mhelp
syntax[0m
for
a
general
introduction
to
the
command
syntax.
Type
[1mhelp
options[0m
for
a
list
of
phpdbg
command
line
options.
Type
[1mhelp
phpdbginit[0m
to
show
how
to
customise
the
debugger
environment.
prompt> exec
expect: spawn id exp3 not open
    while executing
"expect "prompt> " {send "run\r"}"
Sun Nov  6 12:51:41 2022 - INFO  - End of the test.
Sun Nov  6 12:51:44 2022 - INFO  - succeed to execute the case.
Sun Nov  6 12:51:47 2022 - INFO  - Start to restore the test environment.
Sun Nov  6 12:52:47 2022 - INFO  - Finish restoring the test environment.
